In [1]:
import pandas as pd

In [12]:
left = pd.DataFrame(
    {"A": ["A0", "A1", "A2"], "B": ["B0", "B1", "B2"]}, index=["K0", "K1", "K2"]
)

In [13]:
right = pd.DataFrame(
    {"C": ["C0", "C2", "C3"], "D": ["D0", "D2", "D3"]}, index=["K0", "K2", "K3"]
)

In [14]:
Result=left.join(right,how='outer')

In [15]:
# Result.dropna()  # default axis is 0 
Result.dropna(axis=0)  # Drop rows with any null values

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

In [16]:
Result.dropna(axis=1)  # Drop columns with any null values

Empty DataFrame
Columns: []
Index: [K0, K1, K2, K3]

In [17]:
Result

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [18]:
Result.dropna(thresh=2)  # Drop rows where less than 2 non-null values are present

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [19]:
Result.dropna(thresh=3)  # Drop rows where less than 3 non-null values are present

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

<!-- # threshold=4
# 1   2   3     4     5     6    7    8    9   10
  1                   1          1                   ==>1     Delete
           1    1     1     1                            2
      1                                        1         3   Delete
          1    1     1     1     1    1    1             4
                      1     1     1   1    1   1         5 -->

### Fill blank value

In [21]:
# Dataframe_name/column.fillna("value which you want replace at blank values")

In [22]:
Result

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [23]:
Result.fillna("-")

     A   B   C   D
K0  A0  B0  C0  D0
K1  A1  B1   -   -
K2  A2  B2  C2  D2
K3   -   -  C3  D3

In [24]:
Result["D"].fillna(Result["A"],inplace=True)

In [25]:
Result

      A    B    C   D
K0   A0   B0   C0  D0
K1   A1   B1  NaN  A1
K2   A2   B2   C2  D2
K3  NaN  NaN   C3  D3

### Groupby

In [2]:
# grouping the data according to the categories and applying a function to the categories.

In [3]:
data=pd.read_excel(r"D:\Minskole Batch\Python\Employee data.xlsx")

In [4]:
data

,Employee ID,Employee Name,Manager Name,Department,Qualification,Gender,Experience,Salary
0,E001,Pooja Thorat,Vishal Bhosale,Finance,Bachelor,Female,18,103464
1,E002,Shruti Sawant,Neelam Sawant,Engineering,PhD,Male,9,126942
2,E003,Rupal Kulkarni,Aparna Jadhav,HR,PhD,Male,14,129882
3,E004,Shweta Pawar,Siddhi Bhosale,Sales,PhD,Male,2,71092
4,E005,Snehal Jadhav,Siddhi Rathod,Finance,Bachelor,Female,8,104760
...,...,...,...,...,...,...,...,...
95,E096,Gaurav Pawar,Siddhi Rathod,Engineering,Bachelor,Female,6,92906
96,E097,Tejas Mane,Sandeep Gore,Sales,Master,Male,8,64956
97,E098,Madhavi Kadam,Sandeep Rathod,Finance,PhD,Male,11,119764
98,E099,Neha Jadhav,Rajesh Patil,Sales,Diploma,Male,1,76522
99,E100,Neha Chavan,Shubham Rathod,Engineering,PhD,Female,12,63238

In [5]:
# How many employees are there in each department?
department_count = data.groupby('Department')['Employee ID'].count()

In [6]:
department_count

Department
Engineering    12
Finance        20
HR             13
Marketing      18
Operations     18
Sales          19
Name: Employee ID, dtype: int64

In [7]:
department_count.reset_index()

    Department  Employee ID
0  Engineering           12
1      Finance           20
2           HR           13
3    Marketing           18
4   Operations           18
5        Sales           19

In [8]:
data["Department"].value_counts()

Finance        20
Sales          19
Operations     18
Marketing      18
HR             13
Engineering    12
Name: Department, dtype: int64

In [10]:
data["Department"].unique()

array(['Finance', 'Engineering', 'HR', 'Sales', 'Operations', 'Marketing'],
      dtype=object)

In [11]:
data["Department"].nunique()

6